<a href="https://colab.research.google.com/github/GokulvasanV/pandas/blob/main/pandas_tutorial.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Part-- 1**

In [ ]:
print('hello world')

hello world

In [ ]:
import pandas as pd

In [ ]:
web_stats={'Day':[1,2,3,4,5,6],
           'Visitors':[65,34,87,23,39,92],
           'Bouncer_Rate':[65,73,62,64,54,56]}

In [ ]:
df=pd.DataFrame(web_stats)
df

   Day  Visitors  Bouncer_Rate
0    1        65            65
1    2        34            73
2    3        87            62
3    4        23            64
4    5        39            54
5    6        92            56

In [ ]:
# set index as "Day"
df.set_index('Day') # it won't replace in our dataframe

     Visitors  Bouncer_Rate
Day
1          65            65
2          34            73
3          87            62
4          23            64
5          39            54
6          92            56

In [ ]:
df

   Day  Visitors  Bouncer_Rate
0    1        65            65
1    2        34            73
2    3        87            62
3    4        23            64
4    5        39            54
5    6        92            56

In [ ]:
# set index as "Day" and also replace in our dataframe
df.set_index('Day',inplace=True)
df

     Visitors  Bouncer_Rate
Day
1          65            65
2          34            73
3          87            62
4          23            64
5          39            54
6          92            56

In [ ]:
# show specific column
df['Visitors']

Day
1    65
2    34
3    87
4    23
5    39
6    92
Name: Visitors, dtype: int64

In [ ]:
# or you can use this code also for show specific column
df.Visitors

Day
1    65
2    34
3    87
4    23
5    39
6    92
Name: Visitors, dtype: int64


in specific column code won't accept space between words(in column name)

Ex:

**df['Bouncer Rate'] # it will work properly**

df.'Bouncer Rate' # here it won't work because this word has space

In [ ]:
# show multiple columns 
print(df[['Bouncer_Rate','Visitors']])

     Bouncer_Rate  Visitors
Day
1              65        65
2              73        34
3              62        87
4              64        23
5              54        39
6              56        92

In [ ]:
# convert the dict into list
df.Visitors.tolist()

[65, 34, 87, 23, 39, 92]

print(df[['Bouncer_Rate','Visitors']]) # it won't work

***See Below***

In [ ]:
import numpy as np

In [ ]:
print(np.array(df[['Bouncer_Rate','Visitors']])) # convert these Dict columns into array

[[65 65]
 [73 34]
 [62 87]
 [64 23]
 [54 39]
 [56 92]]

## **Part-- 2**

In [ ]:
import pandas as pd
from google.colab import drive
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/Colab Notebooks/dataset/data.csv")
print(df.head())

         Date  Duration  Pulse  Maxpulse  Calories
0  01/12/2022        60    110       130     409.1
1  02/12/2022        60    117       145     479.0
2  03/12/2022        60    103       135     340.0
3  04/12/2022        45    109       175     282.4
4  05/12/2022        45    117       148     406.0

In [ ]:
df.set_index('Date',inplace=True)
print(df.head())

            Duration  Pulse  Maxpulse  Calories
Date
01/12/2022        60    110       130     409.1
02/12/2022        60    117       145     479.0
03/12/2022        60    103       135     340.0
04/12/2022        45    109       175     282.4
05/12/2022        45    117       148     406.0

In [ ]:
df.to_csv('/content/drive/MyDrive/Colab Notebooks/dataset/newcsv2.csv') # create new csv data set

In [ ]:
df=pd.read_csv('/content/drive/MyDrive/Colab Notebooks/dataset/newcsv2.csv',index_col=0) # it won't repeat index
df.head()

            Duration  Pulse  Maxpulse  Calories
Date
01/12/2022        60    110       130     409.1
02/12/2022        60    117       145     479.0
03/12/2022        60    103       135     340.0
04/12/2022        45    109       175     282.4
05/12/2022        45    117       148     406.0

In [ ]:
# rename the column
#df.columns=["no.of days"]
#df.to_csv('/content/drive/MyDrive/Colab Notebooks/dataset/newcsv3.csv')
df.head()

ValueError: ignored

In [ ]:
df.to_csv('/content/drive/MyDrive/Colab Notebooks/dataset/newcsv4.csv', header=False) # it won't show column name

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/Colab Notebooks/dataset/newcsv4.csv",names=['Date','Period','Pulse','Maxpulse','Calories'],index_col=0) #set the column name and won't show without index
df.head()

            Period  Pulse  Maxpulse  Calories
Date
01/12/2022      60    110       130     409.1
02/12/2022      60    117       145     479.0
03/12/2022      60    103       135     340.0
04/12/2022      45    109       175     282.4
05/12/2022      45    117       148     406.0

In [ ]:
df.to_html("/content/drive/MyDrive/Colab Notebooks/dataset/newcsv_html.html") # save for html file

In [ ]:
df=pd.read_csv("/content/drive/MyDrive/Colab Notebooks/dataset/newcsv4.csv",names=['Date','Period','Pulse','Maxpulse','Calories']) #set the column name and show with index
df.head()

         Date  Period  Pulse  Maxpulse  Calories
0  01/12/2022      60    110       130     409.1
1  02/12/2022      60    117       145     479.0
2  03/12/2022      60    103       135     340.0
3  04/12/2022      45    109       175     282.4
4  05/12/2022      45    117       148     406.0

In [ ]:
# rename column name
df.rename(columns={'Period':'Duration'},inplace=True)
df.head()

         Date  Duration  Pulse  Maxpulse  Calories
0  01/12/2022        60    110       130     409.1
1  02/12/2022        60    117       145     479.0
2  03/12/2022        60    103       135     340.0
3  04/12/2022        45    109       175     282.4
4  05/12/2022        45    117       148     406.0

## **part-- 3**

In [ ]:
# import quandl
import pandas as pd

In [ ]:
US_states = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')  # taking data from website
print(US_states)

[   Name &postal abbs. [1]                          Unnamed: 2_level_0  \
   Name &postal abbs. [1] Name &postal abbs. [1].1 Unnamed: 2_level_1
0                 Alabama                      NaN                 AL
1                  Alaska                      NaN                 AK
2                 Arizona                      NaN                 AZ
3                Arkansas                      NaN                 AR
4              California                      NaN                 CA
5                Colorado                      NaN                 CO
6             Connecticut                      NaN                 CT
7                Delaware                      NaN                 DE
8                 Florida                      NaN                 FL
9                 Georgia                      NaN                 GA
10                 Hawaii                      NaN                 HI
11                  Idaho                      NaN                 ID
12               Illinois                      NaN                 IL
13                Indiana                      NaN                 IN
14                   Iowa                      NaN                 IA
15                 Kansas                      NaN                 KS
16            Kentucky[C]                      NaN                 KY
17              Louisiana                      NaN                 LA
18                  Maine                      NaN                 ME
19               Maryland                      NaN                 MD
20       Massachusetts[C]                      NaN                 MA
21               Michigan                      NaN                 MI
22              Minnesota                      NaN                 MN
23            Mississippi                      NaN                 MS
24               Missouri                      NaN                 MO
25                Montana                      NaN                 MT
26               Nebraska                      NaN                 NE
27                 Nevada                      NaN                 NV
28          New Hampshire                      NaN                 NH
29             New Jersey                      NaN                 NJ
30             New Mexico                      NaN                 NM
31               New York                      NaN                 NY
32         North Carolina                      NaN                 NC
33           North Dakota                      NaN                 ND
34                   Ohio                      NaN                 OH
35               Oklahoma                      NaN                 OK
36                 Oregon                      NaN                 OR
37        Pennsylvania[C]                      NaN                 PA
38           Rhode Island                      NaN                 RI
39         South Carolina                      NaN                 SC
40           South Dakota                      NaN                 SD
41              Tennessee                      NaN                 TN
42                  Texas                      NaN                 TX
43                   Utah                      NaN                 UT
44                Vermont                      NaN                 VT
45            Virginia[C]                      NaN                 VA
46             Washington                      NaN                 WA
47          West Virginia                      NaN                 WV
48              Wisconsin                      NaN                 WI
49                Wyoming                      NaN                 WY

            Cities                            Established[A] Population[B][3]  \
           Capital Largest (by population)[5] Established[A] Population[B][3]
0       Montgomery                 Birmingham   Dec 14, 1819          4903185
1           Juneau                  Anchorage    Jan 3, 1959           731545
2          Phoenix                    Phoenix   Feb 14, 1912          7278717
3      Little Rock                Little Rock   Jun 15, 1836          3017804
4       Sacramento                Los Angeles    Sep 9, 1850         39512223
5           Denver                     Denver    Aug 1, 1876          5758736
6         Hartford                 Bridgeport    Jan 9, 1788          3565278
7            Dover                 Wilmington    Dec 7, 1787           973764
8      Tallahassee               Jacksonville    Mar 3, 1845         21477737
9          Atlanta                    Atlanta    Jan 2, 1788         10617423
10        Honolulu                   Honolulu   Aug 21, 1959          1415872
11           Boise                      Boise    Jul 3, 1890          1787065
12     Springfield                    Chicago    Dec 3, 1818         12671821
13    Indianapolis               Indianapolis   Dec 11, 1816          6732219
14      Des Moines                 Des Moines   Dec 28, 1846          3155070
15          Topeka                    Wichita   Jan 29, 1861          2913314
16       Frankfort                 Louisville    Jun 1, 1792          4467673
17     Baton Rouge                New Orleans   Apr 30, 1812          4648794
18         Augusta                   Portland   Mar 15, 1820          1344212
19       Annapolis                  Baltimore   Apr 28, 1788          6045680
20          Boston                     Boston    Feb 6, 1788          6892503
21         Lansing                    Detroit   Jan 26, 1837          9986857
22        St. Paul                Minneapolis   May 11, 1858          5639632
23         Jackson                    Jackson   Dec 10, 1817          2976149
24  Jefferson City                Kansas City   Aug 10, 1821          6137428
25          Helena                   Billings    Nov 8, 1889          1068778
26         Lincoln                      Omaha    Mar 1, 1867          1934408
27     Carson City                  Las Vegas   Oct 31, 1864          3080156
28         Concord                 Manchester   Jun 21, 1788          1359711
29         Trenton                     Newark   Dec 18, 1787          8882190
30        Santa Fe                Albuquerque    Jan 6, 1912          2096829
31          Albany                   New York   Jul 26, 1788         19453562
32         Raleigh                  Charlotte   Nov 21, 1789         10488084
33        Bismarck                      Fargo    Nov 2, 1889           762062
34        Columbus                   Columbus    Mar 1, 1803         11689100
35   Oklahoma City              Oklahoma City   Nov 16, 1907          3956971
36           Salem                   Portland   Feb 14, 1859          4217737
37      Harrisburg               Philadelphia   Dec 12, 1787         12801989
38      Providence                 Providence   May 29, 1790          1059361
39        Columbia                 Charleston   May 23, 1788          5148714
40          Pierre                Sioux Falls    Nov 2, 1889           884659
41       Nashville                  Nashville    Jun 1, 1796          6829174
42          Austin                    Houston   Dec 29, 1845         28995881
43  Salt Lake City             Salt Lake City    Jan 4, 1896          3205958
44      Montpelier                 Burlington    Mar 4, 1791           623989
45        Richmond             Virginia Beach   Jun 25, 1788          8535519
46         Olympia                    Seattle   Nov 11, 1889          7614893
47      Charleston                 Charleston   Jun 20, 1863          1792147
48         Madison                  Milwaukee   May 29, 1848          5822434
49        Cheyenne                   Cheyenne   Jul 10, 1890           578759

   Total area[4]          Land area[4]          Water area[4]          \
             mi2      km2          mi2      km2           mi2     km2
0          52420   135767        50645   131171          1775    4597
1         665384  1723337       570641  1477953         94743  245384
2         113990   295234       113594   294207           396    1026
3          53179   137732        52035   134771          1143    2961
4         163695   423967       155779   403466          7916   20501
5         104094   269601       103642   268431           452    1170
6           5543    14357         4842    12542           701    1816
7           2489     6446         1949     5047           540    1399
8          65758   170312        53625   138887         12133   31424
9          59425   153910        57513   148959          1912    4951
10         10932    28313         6423    16635          4509   11678
11         83569   216443        82643   214045           926    2398
12         57914   149995        55519   143793          2395    6202
13         36420    94326        35826    92789           593    1537
14         56273   145746        55857   144669           416    1077
15         82278   213100        81759   211754           520    1346
16         40408   104656        39486   102269           921    2387
17         52378   135659        43204   111898          9174   23761
18         35380    91633        30843    79883          4537   11750
19         12406    32131         9707    25142          2699    6990
20         10554    27336         7800    20202          2754    7134
21         96714   250487        56539   146435         40175  104052
22         86936   225163        79627   206232          7309   18930
23         48432   125438        46923   121531          1508    3907
24         69707   180540        68742   178040           965    2501
25        147040   380831       145546   376962          1494    3869
26         77348   200330        76824   198974           524    1356
27        110572   286380       109781   284332           791    2048
28          9349    24214         8953    23187           397    1027
29          8723    22591         7354    19047          1368    3544
30        121590   314917       121298   314161           292     757
31         54555   141297        47126   122057          7429   19240
32         53819   139391        48618   125920          5201   13471
33         70698   183108        69001   178711          1698    4397
34         44826   116098        40861   105829          3965   10269
35         69899   181037        68595   177660          1304    3377
36         98379   254799        95988   248608          2391    6191
37         46054   119280        44743   115883          1312    3397
38          1545     4001         1034     2678           511    1324
39         32020    82933        30061    77857          1960    5076
40         77116   199729        75811   196350          1305    3379
41         42144   109153        41235   106798           909    2355
42        268596   695662       261232   676587          7365   19075
43         84897   219882        82170   212818          2727    7064
44          9616    24906         9217    23871           400    1035
45         42775   110787        39490   102279          3285    8508
46         71298   184661        66456   172119          4842   12542
47         24230    62756        24038    62259           192     497
48         65496   169635        54158   140268         11339   29367
49         97813   253335        97093   251470           720    1864

   Numberof Reps.
   Numberof Reps.
0               7
1               1
2               9
3               4
4              53
5               7
6               5
7               1
8              27
9              14
10              2
11              2
12             18
13              9
14              4
15              4
16              6
17              6
18              2
19              8
20              9
21             14
22              8
23              4
24              8
25              1
26              3
27              4
28              2
29             12
30              3
31             27
32             13
33              1
34             16
35              5
36              5
37             18
38              2
39              7
40              1
41              9
42             36
43              4
44              1
45             11
46             10
47              3
48              8
49              1  ]

In [ ]:
US_states[0]

   Name &postal abbs. [1]                          Unnamed: 2_level_0  \
   Name &postal abbs. [1] Name &postal abbs. [1].1 Unnamed: 2_level_1
0                 Alabama                      NaN                 AL
1                  Alaska                      NaN                 AK
2                 Arizona                      NaN                 AZ
3                Arkansas                      NaN                 AR
4              California                      NaN                 CA
5                Colorado                      NaN                 CO
6             Connecticut                      NaN                 CT
7                Delaware                      NaN                 DE
8                 Florida                      NaN                 FL
9                 Georgia                      NaN                 GA
10                 Hawaii                      NaN                 HI
11                  Idaho                      NaN                 ID
12               Illinois                      NaN                 IL
13                Indiana                      NaN                 IN
14                   Iowa                      NaN                 IA
15                 Kansas                      NaN                 KS
16            Kentucky[C]                      NaN                 KY
17              Louisiana                      NaN                 LA
18                  Maine                      NaN                 ME
19               Maryland                      NaN                 MD
20       Massachusetts[C]                      NaN                 MA
21               Michigan                      NaN                 MI
22              Minnesota                      NaN                 MN
23            Mississippi                      NaN                 MS
24               Missouri                      NaN                 MO
25                Montana                      NaN                 MT
26               Nebraska                      NaN                 NE
27                 Nevada                      NaN                 NV
28          New Hampshire                      NaN                 NH
29             New Jersey                      NaN                 NJ
30             New Mexico                      NaN                 NM
31               New York                      NaN                 NY
32         North Carolina                      NaN                 NC
33           North Dakota                      NaN                 ND
34                   Ohio                      NaN                 OH
35               Oklahoma                      NaN                 OK
36                 Oregon                      NaN                 OR
37        Pennsylvania[C]                      NaN                 PA
38           Rhode Island                      NaN                 RI
39         South Carolina                      NaN                 SC
40           South Dakota                      NaN                 SD
41              Tennessee                      NaN                 TN
42                  Texas                      NaN                 TX
43                   Utah                      NaN                 UT
44                Vermont                      NaN                 VT
45            Virginia[C]                      NaN                 VA
46             Washington                      NaN                 WA
47          West Virginia                      NaN                 WV
48              Wisconsin                      NaN                 WI
49                Wyoming                      NaN                 WY

            Cities                            Established[A] Population[B][3]  \
           Capital Largest (by population)[5] Established[A] Population[B][3]
0       Montgomery                 Birmingham   Dec 14, 1819          4903185
1           Juneau                  Anchorage    Jan 3, 1959           731545
2          Phoenix                    Phoenix   Feb 14, 1912          7278717
3      Little Rock                Little Rock   Jun 15, 1836          3017804
4       Sacramento                Los Angeles    Sep 9, 1850         39512223
5           Denver                     Denver    Aug 1, 1876          5758736
6         Hartford                 Bridgeport    Jan 9, 1788          3565278
7            Dover                 Wilmington    Dec 7, 1787           973764
8      Tallahassee               Jacksonville    Mar 3, 1845         21477737
9          Atlanta                    Atlanta    Jan 2, 1788         10617423
10        Honolulu                   Honolulu   Aug 21, 1959          1415872
11           Boise                      Boise    Jul 3, 1890          1787065
12     Springfield                    Chicago    Dec 3, 1818         12671821
13    Indianapolis               Indianapolis   Dec 11, 1816          6732219
14      Des Moines                 Des Moines   Dec 28, 1846          3155070
15          Topeka                    Wichita   Jan 29, 1861          2913314
16       Frankfort                 Louisville    Jun 1, 1792          4467673
17     Baton Rouge                New Orleans   Apr 30, 1812          4648794
18         Augusta                   Portland   Mar 15, 1820          1344212
19       Annapolis                  Baltimore   Apr 28, 1788          6045680
20          Boston                     Boston    Feb 6, 1788          6892503
21         Lansing                    Detroit   Jan 26, 1837          9986857
22        St. Paul                Minneapolis   May 11, 1858          5639632
23         Jackson                    Jackson   Dec 10, 1817          2976149
24  Jefferson City                Kansas City   Aug 10, 1821          6137428
25          Helena                   Billings    Nov 8, 1889          1068778
26         Lincoln                      Omaha    Mar 1, 1867          1934408
27     Carson City                  Las Vegas   Oct 31, 1864          3080156
28         Concord                 Manchester   Jun 21, 1788          1359711
29         Trenton                     Newark   Dec 18, 1787          8882190
30        Santa Fe                Albuquerque    Jan 6, 1912          2096829
31          Albany                   New York   Jul 26, 1788         19453562
32         Raleigh                  Charlotte   Nov 21, 1789         10488084
33        Bismarck                      Fargo    Nov 2, 1889           762062
34        Columbus                   Columbus    Mar 1, 1803         11689100
35   Oklahoma City              Oklahoma City   Nov 16, 1907          3956971
36           Salem                   Portland   Feb 14, 1859          4217737
37      Harrisburg               Philadelphia   Dec 12, 1787         12801989
38      Providence                 Providence   May 29, 1790          1059361
39        Columbia                 Charleston   May 23, 1788          5148714
40          Pierre                Sioux Falls    Nov 2, 1889           884659
41       Nashville                  Nashville    Jun 1, 1796          6829174
42          Austin                    Houston   Dec 29, 1845         28995881
43  Salt Lake City             Salt Lake City    Jan 4, 1896          3205958
44      Montpelier                 Burlington    Mar 4, 1791           623989
45        Richmond             Virginia Beach   Jun 25, 1788          8535519
46         Olympia                    Seattle   Nov 11, 1889          7614893
47      Charleston                 Charleston   Jun 20, 1863          1792147
48         Madison                  Milwaukee   May 29, 1848          5822434
49        Cheyenne                   Cheyenne   Jul 10, 1890           578759

   Total area[4]          Land area[4]          Water area[4]          \
             mi2      km2          mi2      km2           mi2     km2
0          52420   135767        50645   131171          1775    4597
1         665384  1723337       570641  1477953         94743  245384
2         113990   295234       113594   294207           396    1026
3          53179   137732        52035   134771          1143    2961
4         163695   423967       155779   403466          7916   20501
5         104094   269601       103642   268431           452    1170
6           5543    14357         4842    12542           701    1816
7           2489     6446         1949     5047           540    1399
8          65758   170312        53625   138887         12133   31424
9          59425   153910        57513   148959          1912    4951
10         10932    28313         6423    16635          4509   11678
11         83569   216443        82643   214045           926    2398
12         57914   149995        55519   143793          2395    6202
13         36420    94326        35826    92789           593    1537
14         56273   145746        55857   144669           416    1077
15         82278   213100        81759   211754           520    1346
16         40408   104656        39486   102269           921    2387
17         52378   135659        43204   111898          9174   23761
18         35380    91633        30843    79883          4537   11750
19         12406    32131         9707    25142          2699    6990
20         10554    27336         7800    20202          2754    7134
21         96714   250487        56539   146435         40175  104052
22         86936   225163        79627   206232          7309   18930
23         48432   125438        46923   121531          1508    3907
24         69707   180540        68742   178040           965    2501
25        147040   380831       145546   376962          1494    3869
26         77348   200330        76824   198974           524    1356
27        110572   286380       109781   284332           791    2048
28          9349    24214         8953    23187           397    1027
29          8723    22591         7354    19047          1368    3544
30        121590   314917       121298   314161           292     757
31         54555   141297        47126   122057          7429   19240
32         53819   139391        48618   125920          5201   13471
33         70698   183108        69001   178711          1698    4397
34         44826   116098        40861   105829          3965   10269
35         69899   181037        68595   177660          1304    3377
36         98379   254799        95988   248608          2391    6191
37         46054   119280        44743   115883          1312    3397
38          1545     4001         1034     2678           511    1324
39         32020    82933        30061    77857          1960    5076
40         77116   199729        75811   196350          1305    3379
41         42144   109153        41235   106798           909    2355
42        268596   695662       261232   676587          7365   19075
43         84897   219882        82170   212818          2727    7064
44          9616    24906         9217    23871           400    1035
45         42775   110787        39490   102279          3285    8508
46         71298   184661        66456   172119          4842   12542
47         24230    62756        24038    62259           192     497
48         65496   169635        54158   140268         11339   29367
49         97813   253335        97093   251470           720    1864

   Numberof Reps.
   Numberof Reps.
0               7
1               1
2               9
3               4
4              53
5               7
6               5
7               1
8              27
9              14
10              2
11              2
12             18
13              9
14              4
15              4
16              6
17              6
18              2
19              8
20              9
21             14
22              8
23              4
24              8
25              1
26              3
27              4
28              2
29             12
30              3
31             27
32             13
33              1
34             16
35              5
36              5
37             18
38              2
39              7
40              1
41              9
42             36
43              4
44              1
45             11
46             10
47              3
48              8
49              1

## ***part--4*** Concatenating and Appending dataframes

In [ ]:
import pandas as pd

df1 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2001, 2002, 2003, 2004])

df2 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'US_GDP_Thousands':[50, 55, 65, 55]},
                   index = [2005, 2006, 2007, 2008])

df3 = pd.DataFrame({'HPI':[80,85,88,85],
                    'Int_rate':[2, 3, 2, 2],
                    'Low_tier_HPI':[50, 52, 50, 53]},
                   index = [2001, 2002, 2003, 2004])

In [ ]:
concat = pd.concat([df1,df2]) #Concatenating df1 & df2
concat

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   85         2                55
2005   80         2                50
2006   85         3                55
2007   88         2                65
2008   85         2                55

In [ ]:
concat = pd.concat([df1,df2,df3]) #Concatenating df1,df2,df3
concat

      HPI  Int_rate  US_GDP_Thousands  Low_tier_HPI
2001   80         2              50.0           NaN
2002   85         3              55.0           NaN
2003   88         2              65.0           NaN
2004   85         2              55.0           NaN
2005   80         2              50.0           NaN
2006   85         3              55.0           NaN
2007   88         2              65.0           NaN
2008   85         2              55.0           NaN
2001   80         2               NaN          50.0
2002   85         3               NaN          52.0
2003   88         2               NaN          50.0
2004   85         2               NaN          53.0

In [ ]:
df4 = df1.append(df2) # appending df2 in df1
df4

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   85         2                55
2005   80         2                50
2006   85         3                55
2007   88         2                65
2008   85         2                55

In [ ]:
df5 = df1.append(df3)
df5

      HPI  Int_rate  US_GDP_Thousands  Low_tier_HPI
2001   80         2              50.0           NaN
2002   85         3              55.0           NaN
2003   88         2              65.0           NaN
2004   85         2              55.0           NaN
2001   80         2               NaN          50.0
2002   85         3               NaN          52.0
2003   88         2               NaN          50.0
2004   85         2               NaN          53.0

In [ ]:
# adding new row in our dataframe
ser = pd.Series([80,2,50], index=['HPI','Int_rate','US_GDP_Thousands'])
df6 = df1.append(ser, ignore_index=True)
df6

   HPI  Int_rate  US_GDP_Thousands
0   80         2                50
1   85         3                55
2   88         2                65
3   85         2                55
4   80         2                50